#!/usr/bin/env python
# -*- coding: utf-8 -*-


data = {
    'דגם': {
        'before': ['דגם', 'מסוג'],
    },

    'שנה': {  # לבדוק אם ניתן להסיק על שנה לפי חיפוש בטווח בין 2000 ל2017
        'before': ['עלה לכביש', 'שנת', 'מודל'],
    },
    'יד': {
        'before': ['יד', 'ידיים'],
        'after': ['ידיים'],
    },
    'מחיר': {
        'before': ['מחיר', 'מבקש'],
        'after': ['ש"ח', 'שח', '₪'],
        'inside': ['ש"ח', 'שח', '₪'],
        'regex': [ur'[\u20aa]\d+[\,\d{3}]*']
    },
    'ק"מ': {
        'before': ['קמ ', 'ק"מ', 'עשה', 'עשתה', 'ק.מ', 'קילומטראז'],
        'after': ['אלף', 'KM', 'קמ', 'ק"מ', 'קילומטר'],
    },
    'נפח מנוע': {
        'before': ['מנוע'],
    },
    'טלפון': {
        'before': ['פרטים', 'לפרטים', 'בטלפון', 'נייד', 'נוספים', 'פלאפון', 'בנייד'],
        'value_check': [r'\d{3}-?\d{3}-?\d{4}'],
        'regex': [r'\d{3}-?\d{3}-?\d{4}']
    }
}
