#!/usr/bin/env python
# -*- coding: utf-8 -*-


data = {
    'שם המכשיר': {
        'before': ['דגם', 'מסוג'],
    },
    'מחיר': {
        'before': ['מחיר', 'ש"ח', 'שח', '₪'],
        'after': ['ש"ח', 'שח', '₪'],
        'regex': [ur'[\u20aa]\d+[\,\d{3}]*']
    },
    'אזור': {
        'before':  ['לקחת', 'איסוף', 'נמצא'],
    },
    'זיכרון': {
        'before': ['זיכרון', 'GB', 'נפח'],
        'after': ['זיכרון', 'GB', 'ג\'יגה'],
    },
    'צבע': {
        'before': ['צבע'],
    },
    'טלפון': {
        'before': ['פרטים', 'לפרטים', 'בטלפון', 'נייד', 'נוספים', 'פלאפון', 'בנייד'],
        'value_check': [r'\d{3}-?\d{3}-?\d{4}'],
        'regex': [r'\d{3}-?\d{3}-?\d{4}']
    }
}
