#!/usr/bin/env python
# -*- coding: utf-8 -*-

data = {
    'words_before_indicator': {
        'מחיר': ['ש"ח', 'שח']
    },
    'words_after_indicator': {
        'סוג מכשיר': ['דגם', 'מסוג'],
        'מחיר': ['שח ', 'ש"ח', '₪ '],
        'אזור': ['לקחת', 'איסוף', 'נמצא'],
        'זיכרון': ['זיכרון', 'GB', 'נפח'],
        'צבע': ['קמ ', 'ק"מ', 'אלף', 'KM', 'עשה', 'ק.מ', 'קילומטראז'],
        'טלפון': ['פרטים', 'לפרטים', 'נייד', 'נוספים', 'פלאפון', 'בנייד']
    },
    'regular_expression': ''
    }
