#!/usr/bin/env python
# -*- coding: utf-8 -*-

data = {

    'דגם': {
        'find': {
            'אאודי': ['אאודי', 'audi'],
            'אוטוביאנקי': ['Autobianchi'],
            'אולדסמוביל': ['Oldsmobile'],
            'אוסטין': ['Austin'],
            'אופל': ['opel'],
            'אלפא-רומאו': ['Alpha romeo'],
            'ביואיק': ['Buick'],
            'ב.מ.וו': ['BMW'],
            'גיאו': [],
            'דודג': ['Dodge'],
            'דייהו': ['Daewoo'],
            'דייהטסו': ['Daihatsu'],
            'הונדה': ['Honda'],
            'וולוו': ['Volvo'],
            'טויוטה': ['Toyota'],
            'יגואר': ['jaguar'],
            'יונדאי': ['Hyundai'],
            'לאדה': [],
            'לנציה': [],
            'מאזדה': ['Mazda'],
            'מיצובישי': ['MITSUBISHI'],
            'מרצדס': ['Mercedes', 'audi'],
            'ניסאן': ['Nissan'],
            'סאאב':[],
            'סובארו': ['Subaru'],
            'סוזוקי': ['Suzuki'],
            'סיאט': ['Seat'],
            'סיטרואן': ['Citroen'],
            'סקודה': ['Skoda'],
            'סמארט': ['Smart'],
            'פיג\'ו': ['Peugeot', 'פזו'],
            'פולקסווגן': ['Volkswagen'],
            'פונטיאק': ['Pontiac'],
            'פורד': ['Ford'],
            'פורשה': ['Porsche'],
            'קאדילק': ['Cadillac'],
            'קיה': ['Kia'],
            'קרייזלר': ['Chrysler'],
            'רובר': [],
            'רנו': ['Renault'],
            'שברולט': ['Chevy'],
            'לינקולן': [],
            'לקסוס': ['Lexus'],
            'אינפיניטי': [],
            'מזראטי': ['Maserati'],
            'פרארי': ['Ferrari'],
            'גרייט וול': [],
            'אסטון מרטין': ['Aston Martin'],
            'דאצ\'יה': ['Dachia']
        }

    }
}
